#Кирилл
#Вариант 3
import math# Добавляем библиотеку

number = int(input("Введите число "))# Просим ввести число с клавиатуры
i = 0# Присвайваем переменной i значение 0
j = 1# Присвайваем переменной j значение 1

while i < number:# Создаём цикл, который будет работать пока переменная i < переменной number (число, которое ввели с клавиатуры)
    print (i)# Выводим значение переменной i
    i, j = j, i + j# Переменной i присвайваем значение переменной j, а переменной j присвайваем значение суммы переменных i и j



